v1/app/controllers/areas_controller.rb

SELECT "areas".* FROM "areas"
---
  def index
    @areas = Area.all

SELECT "areas".* FROM "areas" WHERE "areas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @area = Area.find(params[:id])

INSERT INTO "areas" ("codigo_area", "nombre", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["codigo_area", nil], ["nombre", "Diseño"], ["created_at", "2022-03-25 03:23:42.508035"], ["updated_at", "2022-03-25 03:23:42.508035"]]
---
  def create
    @area = Area.new(area_params)
    if @area.save