v1/app/controllers/areas/cursos_controller.rb

SELECT "areas".* FROM "areas" WHERE "areas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_area
      @area = Area.find(params[:area_id])